# **<font color='crimson'>Databases and SQL Queries</font>**

---

# **3.1 Database 'Testing', Selection Requests**

---

In [ ]:
###

In [ ]:
SELECT
    student.name_student,
    attempt.date_attempt,
    attempt.result
FROM
    student
    INNER JOIN attempt USING (student_id)
    INNER JOIN subject USING (subject_id)
WHERE subject.name_subject LIKE 'Основы баз данных'
ORDER BY attempt.result DESC;

In [ ]:
###

In [ ]:
SELECT
    subject.name_subject,
    COUNT(attempt.attempt_id) AS Количество,
    ROUND(AVG(attempt.result), 2) AS Среднее
FROM subject
    LEFT JOIN attempt USING (subject_id)
GROUP BY subject.name_subject
ORDER BY Среднее DESC;

In [ ]:
###

In [ ]:
SELECT
    student.name_student,
    attempt.result
FROM student
    INNER JOIN attempt USING (student_id)
WHERE result IN (
    SELECT MAX(attempt.result)
    FROM attempt)
ORDER BY student.name_student;

In [ ]:
###

In [ ]:
SELECT
    student.name_student,
    subject.name_subject,
    DATEDIFF(
        MAX(attempt.date_attempt),
        MIN(attempt.date_attempt)) AS Интервал
FROM subject
    INNER JOIN attempt USING (subject_id)
    INNER JOIN student USING (student_id)
GROUP BY
    student.name_student,
    subject.name_subject
HAVING
    Интервал <> 0
ORDER BY Интервал;

In [ ]:
SELECT
    student.name_student,
    subject.name_subject,
    DATEDIFF(
        MAX(attempt.date_attempt),
        MIN(attempt.date_attempt)) AS Интервал
FROM subject
    INNER JOIN attempt USING (subject_id)
    INNER JOIN student USING (student_id)
GROUP BY
    student.name_student,
    subject.name_subject
HAVING
    COUNT(date_attempt) > 1
ORDER BY Интервал;

In [ ]:
###

In [ ]:
SELECT
    subject.name_subject,
    COUNT(DISTINCT attempt.student_id) AS Количество
FROM subject
    LEFT JOIN attempt USING (subject_id)
GROUP BY subject.name_subject
ORDER BY
    Количество DESC,
    subject.name_subject ASC;

In [ ]:
###

In [ ]:
SELECT
    question.question_id,
    question.name_question
FROM question
    INNER JOIN subject USING (subject_id)
WHERE subject.name_subject LIKE 'Основы баз данных'
ORDER BY RAND()
LIMIT 3;

In [ ]:
###

In [ ]:
SELECT
    question.name_question,
    answer.name_answer,
    IF(answer.is_correct = 1, 'Верно', 'Неверно') AS Результат
FROM question
    INNER JOIN answer USING (question_id)
    INNER JOIN testing USING (answer_id, question_id)
    INNER JOIN attempt USING (attempt_id)
    INNER JOIN student USING (student_id)
    INNER JOIN subject
        ON attempt.subject_id = subject.subject_id
WHERE
    -- testing.attempt_id = 7
    student.name_student = 'Семенов Иван'
    AND subject.name_subject = 'Основы SQL'
    AND attempt.date_attempt = '2020-05-17';

In [ ]:
###

In [ ]:
SELECT
    student.name_student,
    subject.name_subject,
    attempt.date_attempt,
    ROUND((SUM(answer.is_correct) / 3) * 100, 2) AS Результат
FROM subject
    INNER JOIN attempt
        ON subject.subject_id = attempt.subject_id
    INNER JOIN student
        ON student.student_id = attempt.student_id
    INNER JOIN testing
        ON attempt.attempt_id = testing.attempt_id
    INNER JOIN answer
        ON testing.answer_id = answer.answer_id
        AND testing.question_id = answer.question_id
GROUP BY
    student.name_student,
    subject.name_subject,
    attempt.date_attempt
ORDER BY
    student.name_student ASC,
    attempt.date_attempt DESC;

In [ ]:
SELECT
    student.name_student,
    subject.name_subject,
    attempt.date_attempt,
    ROUND((SUM(answer.is_correct) / 3) * 100, 2) AS Результат
FROM subject
    INNER JOIN attempt
        ON subject.subject_id = attempt.subject_id
    INNER JOIN student
        ON student.student_id = attempt.student_id
    INNER JOIN testing
        ON attempt.attempt_id = testing.attempt_id
    INNER JOIN answer
        ON testing.answer_id = answer.answer_id
        AND testing.question_id = answer.question_id
GROUP BY
    testing.attempt_id
ORDER BY
    student.name_student ASC,
    attempt.date_attempt DESC;

In [ ]:
###

In [ ]:
SELECT
    subject.name_subject,
    CONCAT(LEFT(question.name_question, 30), '...') AS Вопрос,
    COUNT(testing.testing_id) AS Всего_ответов,
    ROUND(AVG(is_correct) * 100, 2) AS Успешность
FROM subject
    INNER JOIN question
        ON subject.subject_id = question.subject_id
    INNER JOIN answer
        ON question.question_id = answer.question_id
    INNER JOIN testing
        ON answer.answer_id = testing.answer_id
GROUP BY
    subject.name_subject,
    question.name_question
ORDER BY
    subject.name_subject ASC,
    Успешность DESC,
    Вопрос ASC;

In [ ]:
SELECT
    subject.name_subject,
    CONCAT(LEFT(question.name_question, 30), '...') AS Вопрос,
    COUNT(testing.testing_id) AS Всего_ответов,
    ROUND((SUM(answer.is_correct) / COUNT(is_correct)) * 100, 2) AS Успешность
FROM subject
    INNER JOIN question
        ON subject.subject_id = question.subject_id
    INNER JOIN answer
        ON question.question_id = answer.question_id
    INNER JOIN testing
        ON answer.answer_id = testing.answer_id
    INNER JOIN attempt
        ON testing.attempt_id = attempt.attempt_id
GROUP BY
    subject.name_subject,
    question.name_question
ORDER BY
    subject.name_subject ASC,
    Успешность DESC,
    Вопрос ASC;

In [ ]:
###

Score the students on the best test scores:

* 100 - 86 - отлично
* 85 - 70  -  хорошо
* 69 - 51  -  удовлетв.
* 0 - 50   -   неудовлетв.

In [ ]:
SELECT
    student.name_student,
    subject.name_subject,
    MAX(attempt.result) AS Результат,
    IF(MAX(attempt.result) BETWEEN 86 AND 100, 'отлично', IF(MAX(attempt.result) BETWEEN 70 AND 85, 'хорошо', IF(MAX(attempt.result) BETWEEN 51 AND 69, 'удовлетв.', 'неудовлетв'))) AS Оценка
FROM subject
    INNER JOIN attempt
        ON subject.subject_id = attempt.subject_id
    INNER JOIN student
        ON attempt.student_id = student.student_id
GROUP BY
    student.name_student,
    subject.name_subject
ORDER BY
    subject.name_subject ASC,
    Результат DESC;

# **3.2 Database 'Testing', Adjustment Requests**

---

In [ ]:
###

In [ ]:
INSERT INTO attempt
    (student_id, subject_id, date_attempt, result)
SELECT
    attempt.student_id,
    attempt.subject_id,
    NOW(),
    NULL
FROM subject
    INNER JOIN attempt
        ON subject.subject_id = attempt.subject_id
    INNER JOIN student
        ON attempt.student_id = student.student_id
WHERE
    student.name_student LIKE 'Баранов Павел'
    AND subject.name_subject LIKE 'Основы баз данных';

SELECT * FROM attempt;

In [ ]:
###

In [ ]:
UPDATE attempt
SET
    attempt.result = (
    SELECT ROUND(SUM(is_correct) / 3 * 100)
    FROM answer
        INNER JOIN testing
            ON answer.answer_id = testing.answer_id
    WHERE attempt_id IN (
        SELECT *
        FROM (SELECT MAX(attempt.attempt_id) FROM attempt) AS query_1)
    GROUP BY attempt_id)
WHERE attempt_id IN (
        SELECT *
        FROM (SELECT MAX(attempt.attempt_id) FROM attempt) AS query_2);
SELECT * FROM attempt;

In [ ]:
UPDATE attempt
SET
    attempt.result = (
    SELECT
        ROUND((SUM(answer.is_correct) / 3) * 100, 2) AS Результат
    FROM subject
        INNER JOIN (SELECT * FROM attempt) AS query
            ON subject.subject_id = query.subject_id
        INNER JOIN student
            ON student.student_id = query.student_id
        INNER JOIN testing
            ON query.attempt_id = testing.attempt_id
        INNER JOIN answer
            ON testing.answer_id = answer.answer_id
            AND testing.question_id = answer.question_id
    WHERE testing.attempt_id = 8)
WHERE attempt.attempt_id = 8;

SELECT * FROM attempt;

In [ ]:
###

In [ ]:
DELETE FROM attempt
WHERE attempt.date_attempt < '2020-05-01';

SELECT * FROM attempt;
SELECT * FROM testing;

In [ ]:
###

Студента Ивана Семенова не устроил последний результат теста. Пока преподаватель не видит, он просит одногруппника исправить данные в базе, чтобы убрать результаты последней попытки, сделав вид, что он его еще не выполнял.

Сначала одногруппник узнает номер попытки, а затем удаляет необходимую информацию.

In [ ]:
WITH subquery AS (
    SELECT attempt.attempt_id
    FROM student
        LEFT JOIN attempt
            ON student.student_id = attempt.student_id
    WHERE student.name_student LIKE 'Семенов Иван'
    ORDER BY attempt.attempt_id DESC
    LIMIT 1)

DELETE FROM attempt
WHERE attempt.attempt_id IN (
    SELECT * FROM subquery);

SELECT * FROM attempt;
SELECT * FROM testing;

# **3.3 Database 'Entrant', selection requests**

---

In [ ]:
###

In [ ]:
SELECT
    enrollee.name_enrollee
FROM enrollee
    INNER JOIN program_enrollee USING(enrollee_id)
    INNER JOIN program USING(program_id)
WHERE program.name_program LIKE 'Мехатроника и робототехника'
ORDER BY enrollee.name_enrollee ASC;

In [ ]:
###

In [ ]:
SELECT
    program.name_program
FROM program
    INNER JOIN program_subject USING(program_id)
    INNER JOIN subject USING(subject_id)
WHERE subject.name_subject = 'Информатика'
ORDER BY program.name_program DESC;

In [ ]:
###

In [ ]:
SELECT
    subject.name_subject,
    COUNT(enrollee_subject.enrollee_id) AS Количество,
    MAX(enrollee_subject.result) AS Максимум,
    MIN(enrollee_subject.result) AS Минимум,
    ROUND(AVG(enrollee_subject.result), 1) AS Среднее
FROM subject
    INNER JOIN enrollee_subject USING(subject_id)
GROUP BY subject.name_subject
ORDER BY subject.name_subject ASC;

In [ ]:
###

In [ ]:
SELECT
    program.name_program
FROM program
    INNER JOIN program_subject USING(program_id)
GROUP BY program.name_program
HAVING MIN(program_subject.min_result) >= 40
ORDER BY program.name_program;

In [ ]:
###

In [ ]:
SELECT
    program.name_program,
    program.plan
FROM program
WHERE program.plan = (
    SELECT MAX(plan)
    FROM program);

In [ ]:
###

In [ ]:
SELECT
    enrollee.name_enrollee,
    IF(SUM(bonus) IS NULL,
       0,
       SUM(bonus)) AS Бонус
FROM enrollee
    LEFT JOIN enrollee_achievement USING (enrollee_id)
    LEFT JOIN achievement USING (achievement_id)
GROUP BY enrollee.name_enrollee
ORDER BY enrollee.name_enrollee;

In [ ]:
###

In [ ]:
SELECT
    department.name_department,
    program.name_program,
    program.plan AS plan,
    COUNT(enrollee_id) AS Количество,
    ROUND(COUNT(enrollee_id) / plan, 2) AS Конкурс
FROM department
    INNER JOIN program USING (department_id)
    INNER JOIN program_enrollee USING (program_id)
GROUP BY
    department.name_department,
    program.name_program,
    program.plan
ORDER BY Конкурс DESC;

In [ ]:
###

In [ ]:
SELECT
    program.name_program
FROM program
    INNER JOIN program_subject USING (program_id)
    INNER JOIN subject USING (subject_id)
WHERE
    subject.name_subject LIKE 'Информатика'
    OR subject.name_subject LIKE 'Математика'
GROUP BY program.name_program
HAVING COUNT(program_subject.subject_id) = 2
ORDER BY program.name_program;

In [ ]:
###

In [ ]:
SELECT
    program.name_program,
    enrollee.name_enrollee,
    SUM(result) AS itog
FROM enrollee
    INNER JOIN program_enrollee USING (enrollee_id)
    INNER JOIN program USING (program_id)
    INNER JOIN program_subject USING (program_id)
    INNER JOIN subject USING (subject_id)
    INNER JOIN enrollee_subject
        ON subject.subject_id = enrollee_subject.subject_id
        AND enrollee_subject.enrollee_id = enrollee.enrollee_id
GROUP BY
    program.name_program,
    enrollee.name_enrollee
ORDER BY
    program.name_program ASC,
    SUM(result) DESC;

In [ ]:
###

In [ ]:
SELECT
    program.name_program,
    enrollee.name_enrollee
FROM enrollee
    INNER JOIN program_enrollee USING (enrollee_id)
    INNER JOIN program USING (program_id)
    INNER JOIN program_subject USING (program_id)
    INNER JOIN enrollee_subject
        ON program_subject.subject_id = enrollee_subject.subject_id
        AND enrollee_subject.enrollee_id = enrollee.enrollee_id
WHERE result < min_result
ORDER BY
    program.name_program,
    enrollee.name_enrollee;

In [ ]:
###

Определить на какие образовательные программы подала заявление абитуриентка Степанова Дарья, минимально необходимую сумму баллов по предметам ЕГЭ для этих программ, а также сумму баллов по предметам ЕГЭ для этих программ, которые она набрала.

In [ ]:
SELECT
    program.name_program AS program,
    enrollee.name_enrollee AS name,
    SUM(program_subject.min_result) AS 'Проходный балл',
    SUM(enrollee_subject.result) AS 'Сумма баллов'
FROM program
    INNER JOIN program_subject USING (program_id)
    INNER JOIN subject USING (subject_id)
    INNER JOIN enrollee_subject USING (subject_id)
    INNER JOIN enrollee
        ON enrollee_subject.enrollee_id = enrollee.enrollee_id
WHERE
    enrollee.name_enrollee LIKE 'Степанова Дарья'
    AND program.program_id IN (
        SELECT DISTINCT program_enrollee.program_id
        FROM enrollee
            INNER JOIN program_enrollee USING (enrollee_id)
        WHERE enrollee.name_enrollee LIKE 'Степанова Дарья'
    )
GROUP BY
    program.name_program,
    enrollee.name_enrollee;

# **3.4 Database 'Entrant', Adjustment Requests**

---

In [ ]:
###

In [ ]:
/*объединение трех таблиц*/
CREATE TABLE applicant AS
SELECT
    program_enrollee.program_id,
    program_enrollee.enrollee_id,
    SUM(enrollee_subject.result) AS itog
FROM program_subject
    INNER JOIN enrollee_subject
        ON program_subject.subject_id = enrollee_subject.subject_id
    INNER JOIN program_enrollee
        ON program_enrollee.program_id = program_subject.program_id
        AND program_enrollee.enrollee_id = enrollee_subject.enrollee_id
GROUP BY
    program_enrollee.program_id,
    program_enrollee.enrollee_id
ORDER BY
    program_enrollee.program_id ASC,
    SUM(enrollee_subject.result) DESC;
SELECT * FROM applicant;

In [ ]:
/*объединение шести таблиц 'по кольцу'*/
CREATE TABLE applicant AS
SELECT
    program.program_id,
    enrollee.enrollee_id,
    SUM(result) AS itog
FROM enrollee
    INNER JOIN enrollee_subject
        ON enrollee.enrollee_id = enrollee_subject.enrollee_id
    INNER JOIN subject
        ON enrollee_subject.subject_id = subject.subject_id
    INNER JOIN program_subject
        ON subject.subject_id = program_subject.subject_id
    INNER JOIN program
        ON program_subject.program_id = program.program_id
    INNER JOIN program_enrollee
        ON enrollee.enrollee_id = program_enrollee.enrollee_id
        AND program.program_id = program_enrollee.program_id
GROUP BY
    program.program_id,
    enrollee.enrollee_id
ORDER BY
    program.program_id ASC,
    SUM(result) DESC;
SELECT * FROM applicant;

In [ ]:
###

In [ ]:
/*с помощью USING*/
DELETE FROM applicant
USING
    applicant
    INNER JOIN program_subject
        ON applicant.program_id = program_subject.program_id
    INNER JOIN enrollee_subject
        ON applicant.enrollee_id = enrollee_subject.enrollee_id
        AND program_subject.subject_id = enrollee_subject.subject_id
WHERE enrollee_subject.result < program_subject.min_result;

SELECT * FROM applicant;

In [ ]:
/*с помощью подзапроса*/
WITH subquery AS (
    SELECT
        program_subject.program_id,
        enrollee_subject.enrollee_id
    FROM enrollee_subject
        INNER JOIN program_subject
            ON enrollee_subject.subject_id = program_subject.subject_id
        INNER JOIN program_enrollee
            ON program_subject.subject_id = program_enrollee.program_id
            AND enrollee_subject.enrollee_id = program_enrollee.enrollee_id
    WHERE enrollee_subject.result < program_subject.min_result)

DELETE FROM applicant
WHERE applicant.program_id IN (
        SELECT subquery.program_id FROM subquery)
    AND applicant.enrollee_id IN (
        SELECT subquery.enrollee_id FROM subquery);

SELECT * FROM applicant;

In [ ]:
###

In [ ]:
UPDATE
    applicant
    INNER JOIN (
    SELECT
        enrollee_achievement.enrollee_id,
        IF(SUM(bonus) IS NULL, 0, SUM(bonus)) AS Бонус
    FROM enrollee_achievement
        LEFT JOIN achievement USING (achievement_id)
    GROUP BY enrollee_achievement.enrollee_id
    ORDER BY enrollee_achievement.enrollee_id) AS subquery
    USING(enrollee_id)
SET
    applicant.itog = applicant.itog + Бонус;

SELECT * FROM applicant;

In [ ]:
###

In [ ]:
CREATE TABLE applicant_order AS
SELECT
    applicant.program_id,
    applicant.enrollee_id,
    applicant.itog
FROM applicant
ORDER BY
    applicant.program_id ASC,
    applicant.itog DESC;

SELECT * FROM applicant_order;

DROP TABLE applicant;

In [ ]:
###

In [ ]:
ALTER TABLE applicant_order ADD str_id INT FIRST;

SELECT * FROM applicant_order;

In [ ]:
###

In [ ]:
SET @num_pr := 0;
SET @row_num := 1;

UPDATE applicant_order
SET str_id = IF(
    program_id = @num_pr,
    @row_num := @row_num + 1,
    @row_num := 1 AND @num_pr := program_id);

SELECT * FROM applicant_order;

In [ ]:
###

In [ ]:
CREATE TABLE student AS
SELECT
    program.name_program,
    enrollee.name_enrollee,
    applicant_order.itog
FROM program
    LEFT JOIN applicant_order
        ON program.program_id = applicant_order.program_id
    INNER JOIN enrollee
        ON applicant_order.enrollee_id = enrollee.enrollee_id
WHERE applicant_order.str_id <= program.plan
ORDER BY
    program.name_program ASC,
    itog DESC;

SELECT * FROM student;

In [ ]:
###

В таблицу applicant_order внести дополнительный столбец achievement, туда занести название ачивки,  которую имеет студент. Если ачивки у студента нет, то вывести - 'Достижений нет'.

In [ ]:
ALTER TABLE applicant_order ADD Достижения VARCHAR(25) AFTER itog;

UPDATE applicant_order
LEFT JOIN enrollee_achievement
    ON applicant_order.enrollee_id = enrollee_achievement.enrollee_id
LEFT JOIN achievement
    ON enrollee_achievement.achievement_id = achievement.achievement_id
SET applicant_order.Достижения = IF(
    achievement.name_achievement IS NULL,
    'Достижений нет',
    achievement.name_achievement);

SELECT * FROM applicant_order;

# **3.5 Database 'Educational Analytics for the Course'**

---

In [ ]:
###

In [ ]:
SELECT
    CONCAT(LEFT(CONCAT(module.module_id, ' ', module_name), 16), '...') AS Модуль,
    CONCAT(LEFT(CONCAT(module.module_id, '.', lesson.lesson_position, ' ', lesson.lesson_name), 16), '...') AS Урок,
    CONCAT(module.module_id, '.', lesson.lesson_position, '.', step.step_position, ' ', step.step_name) AS Шаг
FROM module
    INNER JOIN lesson
        ON module.module_id = lesson.module_id
    INNER JOIN step
        ON lesson.lesson_id = step.lesson_id
WHERE step.step_name LIKE '%вложенн% %запрос%'
ORDER BY
    Модуль ASC,
    Урок  ASC,
    Шаг ASC;

In [ ]:
###